Autodesk.Revit.DB.ComponentRepeater.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ComponentRepeater.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ComponentRepeater.GetComponentRepeaterIterator
Returns an iterator to the slot collection.
Returns:
The slot iterator.
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.RemoveRepeaters(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Removes component repeaters from the document,
but leaves the individual repeated components in their respective locations and
hosted on their original hosts.
Remarks:
In addition to the component repeaters the component repeater slots
are also removed from the document.
document:
The document that contains the component repeaters to remove.
elementIds:
The set of component repeaters that should be removed.
Returns:
A collection of components that were previously repeated by the component repeater.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementIds do not exist in the document.
-or-
Not all given elements are component repeaters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015 Subscription Update

Autodesk.Revit.DB.ComponentRepeater.RepeatElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Repeats a set of adaptive component hosted on one or more repeating references.
Remarks:
All elements must be adaptive family instances and have no shape handles.
At least one placement point must be hosted on a 1D or 2D repeating reference.
All other placement points can be hosted on a 0D, 1D or 2D repeating reference,
or must be unhosted.
Use Autodesk.Revit.DB.ComponentRepeater.CanElementBeRepeated(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId) to test whether an element meets these conditions.
document:
The document that contains the elements.
elementIds:
The set of adaptive components used as an input pattern for the repeating operation.
Returns:
One or more component repeater objects representing the result pattern of the repeating operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a component repeater.
-or-
The given element id set is empty.
-or-
One or more elements in elementIds do not exist in the document.
-or-
Not all given elements can be repeated. All elements must be adaptive family instances, have no shape handles, and have at least one placement
point hosted on a 1D or 2D repeating reference. The remaining placement points must be either unhosted or hosted on another repeating reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.CanElementBeRepeated(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Determines whether an element can be repeated using the RepeatElements method.
Remarks:
The element must be an adaptive family instance and have no shape handles.
At least one placement point must be hosted on a 1D or 2D repeating reference.
All other placement points can be hosted on a 0D, 1D or 2D repeating reference,
or must be unhosted.
ADoc:
The document containing the element.
elementId:
The element to be tested.
Returns:
True if the element can be repeated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.ComponentRepeater.IsTypeValidForRepeater(Autodesk.Revit.DB.ElementId)
Determines whether given family type can be used as the default type for the repeater.
typeId:
The element id of the type.
Returns:
True if the family type can be used as the default type for the repeater.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.DimensionCount
The dimension count of the component repeater.
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.DefaultFamilyType
The default family type for the component repeater.
Remarks:
The default family type is the type of the instances in default slots. This includes slots that are added when the repeater grows.
When setting this property, all slots with instances of the default type will change their components to an instance of the new default type.
Empty slots will remain unchanged.
Slots with non-default family instances will remain unchanged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Invalid type for the repeater. The type must be an adaptive family with no shape handles.
In addition, it must have same category and same number of placement points as the current type of the repeater.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ComponentRepeater
An element that contains and manages a set of repeated components.
Remarks:
Component repeaters can be used to replicate (repeat) elements hosted on repeating references.
The result of the repeating operation is a collection of slots. Each slot contains one repeated component.
The ComponentRepeater class provides the repeating functionality and access to the slots.
Each repeating reference is capable of hosting one point of an adaptive component. An initial pattern can be created
by populating one or more repeating references with such points. Component repeaters can then be used
to replicate the pattern to fill the rest of the repeating references in the particular repeating reference source.
The repeating references in repeating reference source are arranged in one or two dimensional arrays,
allowing for different kinds of repeating:
One dimensional source allows for repeating along a path.  Two dimensional source allows for repeating across a grid.  It is also possible to host a point on a zero dimensional reference (a point). This point will be shared by all slots.
A zero dimensional source allows for repeating around a single point. It should not be used alone, but together
with at least one other repeating reference source (typically one dimensional.) The point hosted on the zero dimensional
source serves as a central point around which other points can be repeated on their respective repeating reference
sources.
Multiple adaptive components may be hosted on one repeating reference source, and different points of one
adaptive component may be hosted on different repeating reference sources, effectively allowing different points
of an adaptive component to be repeated using different patterns.
Following is a typical component repeater creation workflow:
Get the default repeating reference source from a point element, divided path or divided surface.
(See Autodesk.Revit.DB.RepeatingReferenceSource.HasRepeatingReferenceSource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
and Autodesk.Revit.DB.RepeatingReferenceSource.GetDefaultRepeatingReferenceSource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId).)  Query the bounds of the repeating reference source to find a range of valid coordinates.
(See Autodesk.Revit.DB.RepeatingReferenceSource.DimensionCount
and Autodesk.Revit.DB.RepeatingReferenceSource.GetBounds.)  Create one or more instances of adaptive families that will be repeated.  Host the individual points of an adaptive component on one or more repeating references.
(See Autodesk.Revit.DB.RepeatingReferenceSource.GetReference(Autodesk.Revit.DB.RepeaterCoordinates).)  Repeat the set of adaptive components using the RepeatElements() method.
Component repeaters can only be used in Massing families (the conceptual design environment).
Since:
2014